OdDAIObjectId.op_MemberSelection
\details
The operator for the access through a pointer to an identifier.
\remarks
This method is for internal use.

OdDAIObjectId.objectLeftOnDisk
\details
\returns Returns true if object was unloaded from memory and left on disk

OdDAIObjectId.isNonPersistent
\details
Retrieves whether the identifier's instance is non-persistent.
\returns Returns true if and only if non-null identifier doesn't belong to any owning model and has a link
to owner's identifier.
\remarks Object identifiers for non-persistent instances are created during owning instance's derived
attributes evaluation only. Such identifiers have handle which isn't equal to zero, don't have owning model
and have link to owning instance's object identifier simultaneously.